In [1]:
#pip install mysql-connector-python

In [1]:
import mysql.connector
from mysql.connector import Error

In [2]:
import pandas as pd
import urllib
import os 
import glob
import chardet
import sqlalchemy

In [3]:
import pandas as pd
datos = pd.read_csv('C:\\Users\\diego\\Desktop\\PI01DTS04\\PI01_DATA_ENGINEERING\\DatasetsNew\\producto.csv', 
                      index_col=False, delimiter = ',')
datos.head()

,idProducto,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,NaN,NaN,NaN
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,NaN,NaN,NaN
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,NaN,NaN,NaN
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,NaN,NaN,NaN
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,NaN,NaN,NaN

In [40]:
datos["categoria1"] = datos["categoria1"].fillna("-")

In [44]:
datos["categoria2"] = datos["categoria2"].fillna("-")

In [42]:
datos["categoria3"] = datos["categoria3"].fillna("-")

In [61]:
datos = datos.drop(columns=['categoria1', 'categoria2','categoria3'])

In [62]:
datos.head()

      idProducto       marca                             nombre presentacion
0  0000000001663  LA ANÓNIMA    Radicheta Atada La Anonima 1 Un       1.0 un
1  0000000002288  LA ANÓNIMA      Perejil Atado La Anonima 1 Un       1.0 un
2  0000000205870   SIN MARCA                   Ojo de Bife 1 Kg       1.0 kg
3  0000000205894   SIN MARCA  Milanesa de Peceto Novillito 1 Kg       1.0 kg
4  0000000205955   SIN MARCA         Chiquizuela Novillito 1 Kg       1.0 kg

In [64]:



try:
    connection = mysql.connector.connect(host='localhost',
                                         database='pi01dts04',
                                         user='root',
                                         password='**casancrenClasico28**')
    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Conectado al servidor MYSQL version ", db_Info)
        cursor = connection.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("Conectado a la base de datos: : ", record)
        
        cursor.execute('DROP TABLE IF EXISTS producto;')
        
        print("Creando la tabla producto")
        
        
        creacionTablaProducto = """CREATE TABLE IF NOT EXISTS producto ( 
                                IdProducto    varchar(20) PRIMARY KEY,
                                marca         varchar(40),
                                nombre        varchar(150),
                                presentacion  varchar(50)
                                ) """
        
        cursor = connection.cursor()
        result = cursor.execute(creacionTablaProducto)
        print("La Tabla producto se creeó exitosamente ")
        
        #loop through the data frame
        for i,row in datos.iterrows():
            #here %S means string values 
            sql = "INSERT INTO pi01dts04.producto VALUES (%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            # the connection is not auto committed by default, so we must commit to save our changes
            connection.commit()
        

except Error as e:
    print("Error while connecting to MySQL", e)

Conectado al servidor MYSQL version  8.0.28
Conectado a la base de datos: :  ('pi01dts04',)
Creando la tabla producto
La Tabla producto se creeó exitosamente

KeyboardInterrupt:

In [63]:
if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

MySQL connection is closed

Obtengo error:
Error while connecting to MySQL 1054 (42S22): Unknown column 'nan' in 'field list'
aparentemente el problema está con los valores nan. Veré si modificándolos en el dataframe puedo insertar la data

In [ ]:
#datos["categoria3"] = datos["categoria3"].fillna("-") con eso se subsana el error, de todas maneras es más eficiente
# eliminar esas columnas

In [7]:
finally:
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

MySQL connection is closed

In [14]:
os.chdir('C:\\Users\\diego\\Desktop\\PI01DTS04\\PI01_DATA_ENGINEERING\\DatasetsNew')
extension = 'csv'|
archivos = [i for i in glob.glob('*.{}'.format('csv'))]

In [15]:
for i in range (len(archivos)):
    with open(archivos[i], 'rb') as f:
        resultado = chardet.detect(f.read())
        df = pd.read_csv(archivos[i], encoding= resultado['encoding'])
        df.to_sql('producto', con = connection, index=False, if_exists='append') # El último parámetros puede crear duplicados sino lo uso bien
        #query = sqlalchemy.update(fin.DataSource == None).values(Datasource = archivos[i])
        #session.execute(query)

C:\Users\diego\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement